building-lists.org
#+TITLE: Building lists in C++
#+HTML_HEAD: <script src="https://cdn.jsdelivr.net/npm/mathjax@3/es5/tex-mml-chtml.js"></script>
#+OPTIONS: \n:t tex:t toc:nil



Hello! This is part 2 in a =TBD= part series on creating an LLM from scratch! You can see part 1, the roadmap, [[https://amitav.net/roadmap-llm.html][here]] and part 3, building vectors, [[https://amitav.net/building-vectors.html][here]].


