building-lists.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-10-09 Thu 01:49 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Building lists in C++</title>
<meta name="author" content="Amitav Krishna" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Building lists in C++</h1>
<p>
Hello! This is part 2 in a <code>TBD</code> part series on creating an LLM from scratch! You can see part 1, the roadmap, <a href="https://amitav.net/roadmap-llm.html">here</a> and part 3, building vectors, <a href="https://amitav.net/building-vectors.html">here</a>.<br />
</p>
